test/Lagrangian/injections/constant/Lagrangian/parcel/manualInjectionPositions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       vectorField;
    object      manualInjectionPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(-4 -4 -4) (-4 -4 -2) (-4 -4  0) (-4 -4  2) (-4 -4  4)
(-4 -2 -4) (-4 -2 -2) (-4 -2  0) (-4 -2  2) (-4 -2  4)
(-4  0 -4) (-4  0 -2) (-4  0  0) (-4  0  2) (-4  0  4)
(-4  2 -4) (-4  2 -2) (-4  2  0) (-4  2  2) (-4  2  4)
(-4  4 -4) (-4  4 -2) (-4  4  0) (-4  4  2) (-4  4  4)

(-2 -4 -4) (-2 -4 -2) (-2 -4  0) (-2 -4  2) (-2 -4  4)
(-2 -2 -4) (-2 -2 -2) (-2 -2  0) (-2 -2  2) (-2 -2  4)
(-2  0 -4) (-2  0 -2) (-2  0  0) (-2  0  2) (-2  0  4)
(-2  2 -4) (-2  2 -2) (-2  2  0) (-2  2  2) (-2  2  4)
(-2  4 -4) (-2  4 -2) (-2  4  0) (-2  4  2) (-2  4  4)

( 0 -4 -4) ( 0 -4 -2) ( 0 -4  0) ( 0 -4  2) ( 0 -4  4)
( 0 -2 -4) ( 0 -2 -2) ( 0 -2  0) ( 0 -2  2) ( 0 -2  4)
( 0  0 -4) ( 0  0 -2) ( 0  0  0) ( 0  0  2) ( 0  0  4)
( 0  2 -4) ( 0  2 -2) ( 0  2  0) ( 0  2  2) ( 0  2  4)
( 0  4 -4) ( 0  4 -2) ( 0  4  0) ( 0  4  2) ( 0  4  4)

( 2 -4 -4) ( 2 -4 -2) ( 2 -4  0) ( 2 -4  2) ( 2 -4  4)
( 2 -2 -4) ( 2 -2 -2) ( 2 -2  0) ( 2 -2  2) ( 2 -2  4)
( 2  0 -4) ( 2  0 -2) ( 2  0  0) ( 2  0  2) ( 2  0  4)
( 2  2 -4) ( 2  2 -2) ( 2  2  0) ( 2  2  2) ( 2  2  4)
( 2  4 -4) ( 2  4 -2) ( 2  4  0) ( 2  4  2) ( 2  4  4)

( 4 -4 -4) ( 4 -4 -2) ( 4 -4  0) ( 4 -4  2) ( 4 -4  4)
( 4 -2 -4) ( 4 -2 -2) ( 4 -2  0) ( 4 -2  2) ( 4 -2  4)
( 4  0 -4) ( 4  0 -2) ( 4  0  0) ( 4  0  2) ( 4  0  4)
( 4  2 -4) ( 4  2 -2) ( 4  2  0) ( 4  2  2) ( 4  2  4)
( 4  4 -4) ( 4  4 -2) ( 4  4  0) ( 4  4  2) ( 4  4  4)

( 6 -4 -4) ( 6 -4 -2) ( 6 -4  0) ( 6 -4  2) ( 6 -4  4)
( 6 -2 -4) ( 6 -2 -2) ( 6 -2  0) ( 6 -2  2) ( 6 -2  4)
( 6  0 -4) ( 6  0 -2) ( 6  0  0) ( 6  0  2) ( 6  0  4)
( 6  2 -4) ( 6  2 -2) ( 6  2  0) ( 6  2  2) ( 6  2  4)
( 6  4 -4) ( 6  4 -2) ( 6  4  0) ( 6  4  2) ( 6  4  4)

( 8 -4 -4) ( 8 -4 -2) ( 8 -4  0) ( 8 -4  2) ( 8 -4  4)
( 8 -2 -4) ( 8 -2 -2) ( 8 -2  0) ( 8 -2  2) ( 8 -2  4)
( 8  0 -4) ( 8  0 -2) ( 8  0  0) ( 8  0  2) ( 8  0  4)
( 8  2 -4) ( 8  2 -2) ( 8  2  0) ( 8  2  2) ( 8  2  4)
( 8  4 -4) ( 8  4 -2) ( 8  4  0) ( 8  4  2) ( 8  4  4)

(10 -4 -4) (10 -4 -2) (10 -4  0) (10 -4  2) (10 -4  4)
(10 -2 -4) (10 -2 -2) (10 -2  0) (10 -2  2) (10 -2  4)
(10  0 -4) (10  0 -2) (10  0  0) (10  0  2) (10  0  4)
(10  2 -4) (10  2 -2) (10  2  0) (10  2  2) (10  2  4)
(10  4 -4) (10  4 -2) (10  4  0) (10  4  2) (10  4  4)

(12 -4 -4) (12 -4 -2) (12 -4  0) (12 -4  2) (12 -4  4)
(12 -2 -4) (12 -2 -2) (12 -2  0) (12 -2  2) (12 -2  4)
(12  0 -4) (12  0 -2) (12  0  0) (12  0  2) (12  0  4)
(12  2 -4) (12  2 -2) (12  2  0) (12  2  2) (12  2  4)
(12  4 -4) (12  4 -2) (12  4  0) (12  4  2) (12  4  4)

(14 -4 -4) (14 -4 -2) (14 -4  0) (14 -4  2) (14 -4  4)
(14 -2 -4) (14 -2 -2) (14 -2  0) (14 -2  2) (14 -2  4)
(14  0 -4) (14  0 -2) (14  0  0) (14  0  2) (14  0  4)
(14  2 -4) (14  2 -2) (14  2  0) (14  2  2) (14  2  4)
(14  4 -4) (14  4 -2) (14  4  0) (14  4  2) (14  4  4)

(16 -4 -4) (16 -4 -2) (16 -4  0) (16 -4  2) (16 -4  4)
(16 -2 -4) (16 -2 -2) (16 -2  0) (16 -2  2) (16 -2  4)
(16  0 -4) (16  0 -2) (16  0  0) (16  0  2) (16  0  4)
(16  2 -4) (16  2 -2) (16  2  0) (16  2  2) (16  2  4)
(16  4 -4) (16  4 -2) (16  4  0) (16  4  2) (16  4  4)

(18 -4 -4) (18 -4 -2) (18 -4  0) (18 -4  2) (18 -4  4)
(18 -2 -4) (18 -2 -2) (18 -2  0) (18 -2  2) (18 -2  4)
(18  0 -4) (18  0 -2) (18  0  0) (18  0  2) (18  0  4)
(18  2 -4) (18  2 -2) (18  2  0) (18  2  2) (18  2  4)
(18  4 -4) (18  4 -2) (18  4  0) (18  4  2) (18  4  4)

(20 -4 -4) (20 -4 -2) (20 -4  0) (20 -4  2) (20 -4  4)
(20 -2 -4) (20 -2 -2) (20 -2  0) (20 -2  2) (20 -2  4)
(20  0 -4) (20  0 -2) (20  0  0) (20  0  2) (20  0  4)
(20  2 -4) (20  2 -2) (20  2  0) (20  2  2) (20  2  4)
(20  4 -4) (20  4 -2) (20  4  0) (20  4  2) (20  4  4)

(22 -4 -4) (22 -4 -2) (22 -4  0) (22 -4  2) (22 -4  4)
(22 -2 -4) (22 -2 -2) (22 -2  0) (22 -2  2) (22 -2  4)
(22  0 -4) (22  0 -2) (22  0  0) (22  0  2) (22  0  4)
(22  2 -4) (22  2 -2) (22  2  0) (22  2  2) (22  2  4)
(22  4 -4) (22  4 -2) (22  4  0) (22  4  2) (22  4  4)

(24 -4 -4) (24 -4 -2) (24 -4  0) (24 -4  2) (24 -4  4)
(24 -2 -4) (24 -2 -2) (24 -2  0) (24 -2  2) (24 -2  4)
(24  0 -4) (24  0 -2) (24  0  0) (24  0  2) (24  0  4)
(24  2 -4) (24  2 -2) (24  2  0) (24  2  2) (24  2  4)
(24  4 -4) (24  4 -2) (24  4  0) (24  4  2) (24  4  4)
)

// ************************************************************************* //
